Revit 2026 API

# FilledRegionCreateMaskingRegion(Document, ElementId, IListCurveLoop) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static FilledRegion CreateMaskingRegion(
	Document document,
	ElementId viewId,
	IList<CurveLoop> boundaries
)
```
```vb
Public Shared Function CreateMaskingRegion (
	document As Document,
	viewId As ElementId,
	boundaries As IList(Of CurveLoop)
) As FilledRegion
```
```cpp
public:
static FilledRegion^ CreateMaskingRegion(
	Document^ document,
	ElementId^ viewId,
	IList<CurveLoop^>^ boundaries
)
```
```fsharp
static member CreateMaskingRegion :
        document : Document *
        viewId : ElementId *
        boundaries : IList<CurveLoop> -> FilledRegion
```

#### Parameters

document Document

viewId ElementId

boundaries IListCurveLoop

#### Return Value

FilledRegion

#### Reference

FilledRegion Class

CreateMaskingRegion Overload

Autodesk.Revit.DB Namespace